# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\User\Documents\MIT 6.115\finalproject\finalproject\GuitarHero.cydsn\GuitarHero.cyprj
# Date: Tue, 07 May 2024 01:09:06 GMT
#set_units -time ns
create_clock -name {Audio_Clock(routed)} -period 22666.666666666664 -waveform {0 11333.3333333333} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {SD_FS_Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {FPS_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_clock -name {FPS_Clock(fixed-function)} -period 1000 -waveform {0 41.6666666666667} [get_pins {ClockBlock/dclk_glb_ff_1}]
create_generated_clock -name {BLE_UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 313 627} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Audio_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 545 1089} -nominal_period 22666.666666666664 [list [get_pins {ClockBlock/dclk_glb_3}]]

set_false_path -from [get_pins {__ZERO__/q}]

# Component constraints for C:\Users\User\Documents\MIT 6.115\finalproject\finalproject\GuitarHero.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\User\Documents\MIT 6.115\finalproject\finalproject\GuitarHero.cydsn\GuitarHero.cyprj
# Date: Tue, 07 May 2024 01:09:02 GMT
